In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("names/yob2000.txt", names=["Name","Gender","Count"])
df

          Name Gender  Count
0        Emily      F  25956
1       Hannah      F  23082
2      Madison      F  19968
3       Ashley      F  17997
4        Sarah      F  17702
...        ...    ...    ...
29767     Zeph      M      5
29768    Zeven      M      5
29769    Ziggy      M      5
29770       Zo      M      5
29771    Zyier      M      5

[29772 rows x 3 columns]

In [13]:
df[(df["Name"]== "Alex")&(df["Gender"]=="M")]

       Name Gender  Count  Year
17716  Alex      M   6747  2000

In [92]:
def count_top3(years):
    
    list_names_for_years =list()
    for year in years:
        df = pd.read_csv('names/yob{}.txt'.format(year), names=["Name","Gender","Count"])
        df["Year"] = year

        list_names_for_years.append( df[(df["Gender"] == "M")&(df["Year"] == year)].head(1))
    df_res = pd.concat(list_names_for_years)
    df_res.reset_index(inplace=True)

    return df_res

In [93]:
count_top3([1900, 1950, 2000])

   index   Name Gender  Count  Year
0   2224   John      M   9829  1900
1   6111  James      M  86224  1950
2  17655  Jacob      M  34477  2000